Maxjta/hal_at32/include/dt-bindings/pinctrl/at32f437z(m)xx-pinctrl.h
/* ERTC_REFIN */
#define ERTC_REFIN_PB15 \
	AT32_PIN_MUX('B', 15, MUX_0)

/* EVENTOUT */
#define EVENTOUT_PA0 \
	AT32_PIN_MUX('A', 0, MUX_15)
#define EVENTOUT_PA1 \
	AT32_PIN_MUX('A', 1, MUX_15)
#define EVENTOUT_PA10 \
	AT32_PIN_MUX('A', 10, MUX_15)
#define EVENTOUT_PA11 \
	AT32_PIN_MUX('A', 11, MUX_15)
#define EVENTOUT_PA12 \
	AT32_PIN_MUX('A', 12, MUX_15)
#define EVENTOUT_PA13 \
	AT32_PIN_MUX('A', 13, MUX_15)
#define EVENTOUT_PA14 \
	AT32_PIN_MUX('A', 14, MUX_15)
#define EVENTOUT_PA15 \
	AT32_PIN_MUX('A', 15, MUX_15)
#define EVENTOUT_PA2 \
	AT32_PIN_MUX('A', 2, MUX_15)
#define EVENTOUT_PA3 \
	AT32_PIN_MUX('A', 3, MUX_15)
#define EVENTOUT_PA4 \
	AT32_PIN_MUX('A', 4, MUX_15)
#define EVENTOUT_PA5 \
	AT32_PIN_MUX('A', 5, MUX_15)
#define EVENTOUT_PA6 \
	AT32_PIN_MUX('A', 6, MUX_15)
#define EVENTOUT_PA7 \
	AT32_PIN_MUX('A', 7, MUX_15)
#define EVENTOUT_PA8 \
	AT32_PIN_MUX('A', 8, MUX_15)
#define EVENTOUT_PA9 \
	AT32_PIN_MUX('A', 9, MUX_15)
#define EVENTOUT_PB0 \
	AT32_PIN_MUX('B', 0, MUX_15)
#define EVENTOUT_PB1 \
	AT32_PIN_MUX('B', 1, MUX_15)
#define EVENTOUT_PB10 \
	AT32_PIN_MUX('B', 10, MUX_15)
#define EVENTOUT_PB11 \
	AT32_PIN_MUX('B', 11, MUX_15)
#define EVENTOUT_PB12 \
	AT32_PIN_MUX('B', 12, MUX_15)
#define EVENTOUT_PB13 \
	AT32_PIN_MUX('B', 13, MUX_15)
#define EVENTOUT_PB14 \
	AT32_PIN_MUX('B', 14, MUX_15)
#define EVENTOUT_PB15 \
	AT32_PIN_MUX('B', 15, MUX_15)
#define EVENTOUT_PB2 \
	AT32_PIN_MUX('B', 2, MUX_15)
#define EVENTOUT_PB3 \
	AT32_PIN_MUX('B', 3, MUX_15)
#define EVENTOUT_PB4 \
	AT32_PIN_MUX('B', 4, MUX_15)
#define EVENTOUT_PB5 \
	AT32_PIN_MUX('B', 5, MUX_15)
#define EVENTOUT_PB6 \
	AT32_PIN_MUX('B', 6, MUX_15)
#define EVENTOUT_PB7 \
	AT32_PIN_MUX('B', 7, MUX_15)
#define EVENTOUT_PB8 \
	AT32_PIN_MUX('B', 8, MUX_15)
#define EVENTOUT_PB9 \
	AT32_PIN_MUX('B', 9, MUX_15)
#define EVENTOUT_PC13 \
	AT32_PIN_MUX('C', 13, MUX_15)
#define EVENTOUT_PC14 \
	AT32_PIN_MUX('C', 14, MUX_15)
#define EVENTOUT_PC15 \
	AT32_PIN_MUX('C', 15, MUX_15)


/* I2C1_SCL */
#define I2C1_SCL_PA9 \
	AT32_PIN_MUX('A', 9, MUX_8)
#define I2C1_SCL_PB6 \
	AT32_PIN_MUX('B', 6, MUX_4)
#define I2C1_SCL_PB8 \
	AT32_PIN_MUX('B', 8, MUX_4)
#define I2C1_SCL_PH1 \
	AT32_PIN_MUX('H', 0, MUX_4)
#define I2C1_SCL_PC6 \
	AT32_PIN_MUX('C', 6, MUX_4)

/* I2C1_SDA */
#define I2C1_SDA_PA10 \
	AT32_PIN_MUX('A', 10, MUX_8)
#define I2C1_SDA_PB7 \
	AT32_PIN_MUX('B', 7, MUX_4)
#define I2C1_SDA_PB9 \
	AT32_PIN_MUX('B', 9, MUX_4)
#define I2C1_SDA_PC7 \
	AT32_PIN_MUX('C', 7, MUX_4)
#define I2C1_SDA_PH0 \
	AT32_PIN_MUX('H', 0, MUX_4)

/* I2C1_SMBA */
#define I2C1_SMBA_PB5 \
	AT32_PIN_MUX('B', 5, MUX_4)
#define I2C1_SMBA_PC5 \
	AT32_PIN_MUX('C', 5, MUX_4)

/* I2C2_SCL */
#define I2C2_SCL_PA0 \
	AT32_PIN_MUX('A', 0, MUX_4)
#define I2C2_SCL_PA11 \
	AT32_PIN_MUX('A', 11, MUX_4)
#define I2C2_SCL_PB10 \
	AT32_PIN_MUX('B', 10, MUX_4)
#define I2C2_SCL_PD12 \
	AT32_PIN_MUX('D', 12, MUX_4)
#define I2C2_SCL_PF1 \
	AT32_PIN_MUX('F', 1, MUX_4)
#define I2C2_SCL_PH2 \
	AT32_PIN_MUX('H', 2, MUX_4)

/* I2C2_SDA */
#define I2C2_SDA_PA1 \
	AT32_PIN_MUX('A', 1, MUX_4)
#define I2C2_SDA_PA12 \
	AT32_PIN_MUX('A', 12, MUX_4)
#define I2C2_SDA_PB11 \
	AT32_PIN_MUX('B', 11, MUX_4)
#define I2C2_SDA_PB3 \
	AT32_PIN_MUX('B', 3, MUX_4)
#define I2C2_SDA_PB9 \
	AT32_PIN_MUX('B', 9, MUX_7)
#define I2C2_SDA_PC12 \
	AT32_PIN_MUX('C', 12, MUX_4)
#define I2C2_SDA_PD13 \
	AT32_PIN_MUX('D', 13, MUX_4)
#define I2C2_SDA_PF0 \
	AT32_PIN_MUX('F', 0, MUX_4)
#define I2C2_SDA_PH3 \
	AT32_PIN_MUX('H', 3, MUX_4)

/* I2C2_SMBA */
#define I2C2_SMBA_PB12 \
	AT32_PIN_MUX('B', 12, MUX_4)
#define I2C2_SMBA_PD11 \
	AT32_PIN_MUX('D', 11, MUX_4)
#define I2C2_SMBA_PF2 \
	AT32_PIN_MUX('F', 2, MUX_4)

/* I2C3_SCL */
#define I2C3_SCL_PA8 \
	AT32_PIN_MUX('A', 8, MUX_4)
#define I2C3_SCL_PB13 \
	AT32_PIN_MUX('B', 13, MUX_7)
#define I2C3_SCL_PB15 \
	AT32_PIN_MUX('B', 15, MUX_4)
#define I2C3_SCL_PC0 \
	AT32_PIN_MUX('C', 0, MUX_4)
#define I2C3_SCL_PD14 \
	AT32_PIN_MUX('D', 14, MUX_4)
#define I2C3_SCL_PF14 \
	AT32_PIN_MUX('F', 14, MUX_4)

/* I2C3_SDA */
#define I2C3_SDA_PB14 \
	AT32_PIN_MUX('B', 14, MUX_4)
#define I2C3_SDA_PB4 \
	AT32_PIN_MUX('B', 4, MUX_4)
#define I2C3_SDA_PC1 \
	AT32_PIN_MUX('C', 1, MUX_4)
#define I2C3_SDA_PC9 \
	AT32_PIN_MUX('C', 9, MUX_4)
#define I2C3_SDA_PD15 \
	AT32_PIN_MUX('D', 15, MUX_4)
#define I2C3_SDA_PF15 \
	AT32_PIN_MUX('F', 15, MUX_4)

/* I2C3_SMBA */
#define I2C3_SMBA_PA9 \
	AT32_PIN_MUX('A', 9, MUX_4)
#define I2C3_SMBA_PB13 \
	AT32_PIN_MUX('B', 13, MUX_4)
#define I2C3_SMBA_PB2 \
	AT32_PIN_MUX('B', 2, MUX_4)
#define I2C3_SMBA_PF13 \
	AT32_PIN_MUX('F', 13, MUX_4)

/* I2S1_CK */
#define I2S1_CK_PA5 \
	AT32_PIN_MUX('A', 5, MUX_5)
#define I2S1_CK_PB3 \
	AT32_PIN_MUX('B', 3, MUX_5)
#define I2S1_CK_PE13 \
	AT32_PIN_MUX('E', 13, MUX_4)

/* I2S1_MCK */
#define I2S1_MCK_PB0 \
	AT32_PIN_MUX('B', 0, MUX_5)
#define I2S1_MCK_PB6 \
	AT32_PIN_MUX('B', 6, MUX_5)
#define I2S1_MCK_PC4 \
	AT32_PIN_MUX('C', 4, MUX_5)

/* I2S1_SDEXT */
#define I2S1_SDEXT_PA7 \
	AT32_PIN_MUX('A', 7, MUX_5)
#define I2S1_SDEXT_PB5 \
	AT32_PIN_MUX('B', 5, MUX_5)
#define I2S1_SDEXT_PE15 \
	AT32_PIN_MUX('E', 15, MUX_4)
#define I2S1_SDEXT_PG1 \
	AT32_PIN_MUX('G', 1, MUX_5)

/* I2S1_WS */
#define I2S1_WS_PA15 \
	AT32_PIN_MUX('A', 15, MUX_5)
#define I2S1_WS_PA4 \
	AT32_PIN_MUX('A', 4, MUX_5)
#define I2S1_WS_PE12 \
	AT32_PIN_MUX('E', 12, MUX_4)

/* I2S2_CK */
#define I2S2_CK_PA9 \
	AT32_PIN_MUX('A', 9, MUX_5)
#define I2S2_CK_PB1 \
	AT32_PIN_MUX('B', 1, MUX_6)
#define I2S2_CK_PB10 \
	AT32_PIN_MUX('B', 10, MUX_5)
#define I2S2_CK_PB13 \
	AT32_PIN_MUX('B', 13, MUX_5)
#define I2S2_CK_PC7 \
	AT32_PIN_MUX('C', 7, MUX_5)
#define I2S2_CK_PD1 \
	AT32_PIN_MUX('D', 1, MUX_6)
#define I2S2_CK_PD3 \
	AT32_PIN_MUX('D', 3, MUX_5)

/* I2S2_MCK */
#define I2S2_MCK_PA3 \
	AT32_PIN_MUX('A', 3, MUX_5)
#define I2S2_MCK_PA6 \
	AT32_PIN_MUX('A', 6, MUX_6)
#define I2S2_MCK_PC6 \
	AT32_PIN_MUX('C', 6, MUX_5)

/* I2S2_SDEXT */
#define I2S2_SDEXT_PA10 \
	AT32_PIN_MUX('A', 10, MUX_5)
#define I2S2_SDEXT_PC1 \
	AT32_PIN_MUX('C', 1, MUX_7)
#define I2S2_SDEXT_PB15 \
	AT32_PIN_MUX('B', 15, MUX_5)
#define I2S2_SDEXT_PC3 \
	AT32_PIN_MUX('C', 3, MUX_5)
#define I2S2_SDEXT_PD4 \
	AT32_PIN_MUX('D', 4, MUX_6)

